In [2]:
import pandas as pd
df = pd.read_csv("../dados/pessoas.csv")

df.head()

  genero   renda  dias_na_plataforma         cidade  compras_realizadas
0      M  126895                14.0  San Francisco                   0
1      M  161474                14.0          Tokyo                   0
2      M  104723                34.0         London                   1
3      M   43791                28.0         London                   2
4      F  132181                26.0         London                   2

In [ ]:
#df[(df["renda"] > 100000) & (df["compras_realizadas"] == 0)]
#df.query("renda > 100000 and compras_realizadas == 0")
valor_renda = 100000
qtd_compras_realizadas = 0
df.query("renda > @valor_renda and compras_realizadas == @qtd_compras_realizadas").value_counts()

genero  renda   dias_na_plataforma  cidade         compras_realizadas
F       101033  17.0                London         0                     1
        101285  36.0                San Francisco  0                     1
        101512  38.0                Miami          0                     1
        101526  22.0                London         0                     1
        102444  33.0                London         0                     1
                                                                        ..
M       273899  10.0                New York City  0                     1
        277639  32.0                London         0                     1
        282909  25.0                Miami          0                     1
        308439  25.0                New York City  0                     1
        364025  35.0                New York City  0                     1
Name: count, Length: 604, dtype: int64